[
    {
        "id": "1",
        "Name": "Anthony Edward Stark",
        "Gender": "male",
        "Bio": "Anthony Edward Tony Stark was a billionaire industrialist, a founding member of the Avengers, and the former CEO of Stark Industries. A brash but brilliant inventor, Stark was self-described as a genius, billionaire, playboy, and philanthropist. With his great wealth and exceptional technical knowledge, Stark was one of the world's most powerful men following the deaths of his parents and enjoyed the playboy lifestyle for many years until he was kidnapped by the Ten Rings in Afghanistan, while demonstrating a fleet of Jericho missiles. With his life on the line, Stark created an armored suit which he used to escape his captors. Upon returning home, he utilized several more armors to use against terrorists, as well as Obadiah Stane who turned against Stark. Following his fight against Stane, Stark publicly revealed himself as Iron Man.",
        "Date_of_Birth": "May 29, 1970",
        "Date_of_Death": "October 2023",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/TonyStark.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/TonyStark1.jpg"
        ],
        "Title": "Iron Man,Tony Stark",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Tony",
        "played_by": "Robert Downey, Jr."
    },
    {
        "id": "2",
        "Name": "Thor Odinson",
        "Gender": "male",
        "Bio": "Thor Odinson is the Asgardian God of Thunder, the former king of Asgard and New Asgard, and a founding member of the Avengers. When his irresponsible and impetuous behavior reignited a conflict between Asgard and Jotunheim, Thor was denied the right to become king, stripped of his power, and banished to Earth by Odin. While exiled on Earth, Thor learned humility, finding love with Jane Foster, and helped save his new friends from the Destroyer sent by Loki. Due to his selfless act of sacrifice, Thor redeemed himself in his father's eyes and was granted his power once more, which he then used to defeat Loki's schemes of genocide.",
        "Date_of_Birth": "964 A.D.-965 A.D",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Thor.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Thor1.jpeg"
        ],
        "Title": "God of Thunder,Prince of Asgard",
        "Genre": "God",
        "Species": "Asgardian God",
        "alternate_name": "Thor",
        "played_by": "Chris Hemsworth"
    },
    {
        "id": "3",
        "Name": "Steven Grant Rogers",
        "Gender": "male",
        "Bio": "Captain Steven Grant Steve Rogers is a World War II veteran, a founding member of the Avengers, and Earth's first known superhero. Rogers grew up suffering from numerous health problems, and upon America's entry into World War II, he was rejected from serving in the United States Army despite several attempts to enlist. Rogers ultimately volunteered for Project Rebirth, where he was the only recipient of the Super Soldier Serum developed by Abraham Erskine under the Strategic Scientific Reserve. The serum greatly enhanced Rogers' physical abilities to superhuman levels. After Erskine's assassination and being doubted by SSR head director Chester Phillips, Rogers was relegated to performing in war bond campaigns, where he posed as a patriotic mascot under the moniker of Captain America.",
        "Date_of_Birth": "July 4, 1918",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Cap.jpg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Cap1.jpg"
        ],
        "Title": "Steve Rogers,Captain America",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Captain America",
        "played_by": "Chris Evans"
    },
    {
        "id": "4",
        "Name": "Samuel Thomas Wilson",
        "Gender": "male",
        "Bio": "Samuel Thomas Sam Wilson is a former United States Air Force pararescue airman who wielded an experimental military wingsuit, operating under the callsign Falcon. After his wing-man Riley was killed in action, Wilson decided to leave active duty, instead choosing to help other veterans suffering from post-traumatic stress disorder. At this time, Wilson met Steve Rogers and was drawn to his conflict with HYDRA, as Rogers needed help from anyone not associated with S.H.I.E.L.D. since they had been infiltrated by HYDRA. Retaking his old wings, Wilson had then assisted with destroying all of Alexander Pierce's schemes of world domination. Following their victory against Pierce's HYDRA units, Falcon then agreed to assist Rogers in tracking down the Winter Soldier, who was in fact Rogers' close friend who had been brainwashed by HYDRA.",
        "Date_of_Birth": "September 23, 1978",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Falcon.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Falcon1.jpg"
        ],
        "Title": "Falcon,Captain America",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Captain America",
        "played_by": "Anthony Mackie"
    },
    {
        "id": "5",
        "Name": "Robert Bruce Banner",
        "Gender": "male",
        "Bio": "Doctor Robert Bruce Banner, M.D., Ph.D., is a renowned scientist and a founding member of the Avengers. Highly respected for his work in Biochemistry, Nuclear Physics, and Gamma Radiation, Banner was commissioned by Thaddeus Ross to recreate the Super Soldier Serum that created Captain America. However, Ross elected not to inform Banner what he was creating. During the experiment, Banner was exposed to dangerous levels of gamma radiation (rather than vita radiation). As a result, the mild-mannered scientist found that when angered, provoked, or excited, his body and brain would transform into a huge, rage-fueled, primitive-minded creature known as Hulk.",
        "Date_of_Birth": "December 18, 1969",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Hulk.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Hulk1.jpg"
        ],
        "Title": "Doctor Champion",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Hulk",
        "played_by": "Mark Ruffalo"
    },
    {
        "id": "6",
        "Name": "Scott Edward Harris Lang",
        "Gender": "male",
        "Bio": "Scott Edward Harris Lang is a former convicted thief who was struggling to pay child support to his estranged wife for visitation rights to his daughter, Cassie Lang. With the promise of money, he was convinced by Hank Pym to take on the mantle of Ant-Man: a superhero with an advanced suit designed to shrink its wearer to a tiny size while increasing one's toughness, agility, and physical strength. Trained under both Pym and his daughter Hope van Dyne, Ant-Man was to help foil Pym's former protege Darren Cross, who was intending to sell his Yellowjacket Suit design and his copy of the Pym Particles formula to HYDRA and the Ten Rings. However, their plan was discovered by Cross, culminating in a final fight between Yellowjacket and Ant-Man. To defeat Yellowjacket, Ant-Man had to shrink small enough to enter Yellowjacket's suit and destroy it, sending Ant-Man to the Quantum Realm, but Ant-Man was able to escape. Ant-Man's heroism helped restore his relationship with Cassie and his ex-wife, as well as find a new romantic one with van Dyne. Lang soon learned that the Avengers were seeking to recruit him.",
        "Date_of_Birth": "",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Antman.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Antman1.jpg"
        ],
        "Title": "Scott Lang",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Ant-Man",
        "played_by": "Paul Rudd"
    },
    {
        "id": "7",
        "Name": "Peter Benjamin Parker",
        "Gender": "male",
        "Bio": "Peter Benjamin Parker is a former high school student who gained spider-like abilities, fighting crime across New York City as the superhero Spider-Man. While Parker juggled all his continued hero duties with the demands of his high-school life, he was approached by Tony Stark who recruited Spider-Man to join the Avengers Civil War, putting Spider-Man into the brief conflict with his personal hero, Captain America. Parker was given a new suit as well as new Stark technology in exchange for his help, allowing him to return back home to continue his own hero work.",
        "Date_of_Birth": "August 10, 2001",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Parker.jpg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Parker1.jpg"
        ],
        "Title": "Spider-Man",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Peter",
        "played_by": "Tom Holland"
    },
    {
        "id": "8",
        "Name": "Stephen Vincent Strange",
        "Gender": "male",
        "Bio": "Doctor Stephen Vincent Strange, M.D., Ph.D is a Master of the Mystic Arts. Originally being a brilliant but arrogant neurosurgeon, Strange got into a car accident which resulted with his hands becoming crippled. Once Western medicine failed him, Strange embarked on a journey to Kamar-Taj, where he was trained by the Ancient One in the ways of Magic and the Multiverse. Although he focused on healing his hands, Strange was drawn into a conflict with Kaecilius and the Zealots, who were working for Dormammu and had sought to merge Earth with the Dark Dimension to find an eternal life. Following the demise of the Ancient One and the defeat of Kaecilius, Strange then became the new protector for the Sanctum Sanctorum, seeking to defend the Earth from other inter-dimensional threats.",
        "Date_of_Birth": "",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Strange.jpg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Strange.jpg"
        ],
        "Title": "Doctor",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Dr. Strange",
        "played_by": "Benedict Cumberbatch"
    },
    {
        "id": "9",
        "Name": "Wanda Maximoff",
        "Gender": "Female",
        "Bio": "Wanda Maximoff is a native of Sokovia who grew up with her fraternal twin brother, Pietro. Born with the latent mythical ability to harness Chaos Magic, she developed a hatred against Tony Stark and rallied anti-American protests after the Novi Grad Bombings killed her parents. Years later, in an effort to help purge their country of strife, the twins joined HYDRA and agreed to undergo experiments with the Scepter under the supervision of Baron Strucker, with the Mind Stone awakening and amplifying Wanda's powers. While her brother developed super-speed, she attained various psionic abilities. When HYDRA fell, the twins joined Ultron to get their revenge on Stark but abandoned him when they discovered his true intentions to eradicate humanity. Wanda and Pietro joined the Avengers during the Battle of Sokovia to stop Ultron; Pietro was killed during the battle but Wanda survived, and was shortly after relocated to the Avengers Compound",
        "Date_of_Birth": "Early 1989",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Wanda.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Wanda1.jpg"
        ],
        "Title": "Scarlet Witch",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Scarlet Witch",
        "played_by": "Elizabeth Olsen"
    },
    {
        "id": "10",
        "Name": "Loki Laufeyson",
        "Gender": "Fluid",
        "Bio": "Loki Laufeyson was the biological son of Laufey, the ruler of the Frost Giants in Jotunheim, who was abandoned and left to die shortly after his birth. Found by Odin, Loki was taken to Asgard and raised by him and Frigga as an Asgardian prince, along with Thor. When Thor was to be crowned King, Loki had sabotaged the coronation by letting the Frost Giants attack Asgard, thus leading Thor to seek vengeance on Jotunheim, which resulted in Thor's banishment to Earth and Loki finding out the truth about his heritage. Frigga gave Loki the throne when Odin had fallen into the Odinsleep; however, when the Warriors Three and Sif attempted to return Thor home, Loki was forced to try to stop them. Regardless, Thor returned from his exile on Earth and ended Loki's reign, thwarting his attempt to declare war on the Nine Realms with Jotunheim's destruction. With Odin disapproving of his actions, Loki allowed himself to fall through the deep abyss of space, entering a wormhole created by the sudden termination of the Bifrost Bridge.",
        "Date_of_Birth": "965 A.D",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Loki.jpg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Loki1.jpg"
        ],
        "Title": "God of Mischief",
        "Genre": "God",
        "Species": "Frost Giant",
        "alternate_name": "Loki Odinson",
        "played_by": "Tom Hiddleston"
    },
    {
        "id": "11",
        "Name": "T'Challa",
        "Gender": "male",
        "Bio": "T'Challa is the King of Wakanda and the eldest child of T'Chaka and Ramonda. As the Wakandan monarch, he became the holder of the Black Panther mantle. Following the death of his father in the bombing attack orchestrated by Helmut Zemo, T'Challa had set out to kill the Winter Soldier, who was widely believed to be responsible for the attack. During his attempt to find the Winter Soldier, Black Panther had joined a Civil War between the Avengers, where he sided with Iron Man. However, Black Panther eventually learned that Zemo was really the one who had been responsible for his father's demise, as he captured Zemo, handing him over to Everett Ross, while he also vowed never to allow desires of vengeance to consume him again.",
        "Date_of_Birth": "Early 1980s",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Panther.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Panther2.jpg"
        ],
        "Title": "Prince of Wakanda",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Black Panther",
        "played_by": "Chadwick Boseman"
    },
    {
        "id": "12",
        "Name": "Clinton Francis Barton",
        "Gender": "male",
        "Bio": "Clinton Francis Clint Barton is an extremely skilled marksman, a former special agent of S.H.I.E.L.D. and one of the founding members of the Avengers. Known for his use of the bow and arrow as his primary weapon and an extremely keen eyesight and accuracy that earned him the codename Hawkeye, Barton had become one of the best S.H.I.E.L.D. agents, responsible for the recruitment of Black Widow, whom he developed a strong friendship with. Assigned by Nick Fury into watching over the Tesseract, he was brainwashed by Loki and used as his pawn in his attempt to become king of Midgard. However, following their Attack on the Helicarrier, he was freed from Loki's mental controls by Black Widow and joined the Avengers to fight against Loki and the Chitauri army in the battle of New York, ending Loki's invasion, before Hawkeye had returned to his work at a S.H.I.E.L.D..",
        "Date_of_Birth": "Early-Mid 1970s",
        "Date_of_Death": "",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Hawkeye.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Hawkeye2.jpeg"
        ],
        "Title": "Agent of S.H.I.E.L.D. ",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Hawkeye",
        "played_by": "Jeremy Renner"
    },
    {
        "id": "13",
        "Name": "Natalia Alianovna Romanoff",
        "Gender": "female",
        "Bio": "Natalia Alianovna Natasha Romanoff (Russian: Наталья Альяновна Наташа Романов) was one of the most talented spies and assassins in the entire world and a founding member of the Avengers. As a child, she was indoctrinated into the Red Room by General Dreykov, and briefly lived as the surrogate daughter of Alexei Shostakov and Melina Vostokoff while they were undercover in the United States of America. After the Destruction of the North Institute, she underwent extensive psychological conditioning, before graduating from the Red Room as a Widow. Working as an operative for the KGB, she was targeted by S.H.I.E.L.D., before given the chance to ultimately defect to the organization by Clint Barton by assassinating Dreykov. Romanoff succeeded, although having to use his daughter Antonia Dreykov's life as collateral damage would haunt her for the rest of her life.",
        "Date_of_Birth": "December 3, 1984",
        "Date_of_Death": "August 2014",
        "Posters": [
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Widow1.jpeg",
            "https://raw.githubusercontent.com/SmartApps-Ind/Avengers-Gallery/master/images/src/Widow2.jpeg"
        ],
        "Title": "Agent of S.H.I.E.L.D. ",
        "Genre": "SuperHero",
        "Species": "Human",
        "alternate_name": "Black Widow",
        "played_by": "Scarlett Johansson"
    }
]